tap 'caskroom/cask'
tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'buo/cask-upgrade'
tap 'Schniz/tap'
tap 'yqrashawn/goku'

brew 'brew-cask-completion'
brew 'coreutils'
brew 'duti'
brew 'emacs'
# should I run `brew services start emacs`?
brew 'ffmpeg'
# brew 'findutils', args: ['with-default-names']
brew 'fish'
brew 'gcc'
brew 'gdb'
brew 'git'
brew 'glib'
brew 'mas'
brew 'openssl'
brew 'python@2'
brew 'python'
brew 'sqlite'
brew 'wget'
brew 'yqrashawn/goku/goku'

cask 'adobe-acrobat-reader'
cask 'alfred'
cask 'bartender'
cask 'bettertouchtool'
cask 'daisydisk'
cask 'docker'
cask 'firefox'
cask 'flux'
cask 'font-hack-nerd-font'
cask 'font-fira-code'
cask 'google-chrome'
cask 'hammerspoon'
cask 'iterm2'
cask 'karabiner-elements'
cask 'little-snitch'
cask 'pgadmin4'
cask 'postman'
cask 'slack'
cask 'spotify'
cask 'the-unarchiver'
cask 'visual-studio-code'

mas 'Amphetamine', id: 937984704
# mas 'Xcode', id: 497799835
